{"url":"https://api.github.com/repos/elastic/elasticsearch/issues/61352","repository_url":"https://api.github.com/repos/elastic/elasticsearch","labels_url":"https://api.github.com/repos/elastic/elasticsearch/issues/61352/labels{/name}","comments_url":"https://api.github.com/repos/elastic/elasticsearch/issues/61352/comments","events_url":"https://api.github.com/repos/elastic/elasticsearch/issues/61352/events","html_url":"https://github.com/elastic/elasticsearch/issues/61352","id":682282812,"node_id":"MDU6SXNzdWU2ODIyODI4MTI=","number":61352,"title":"The field process.command_line needs to be keyword type for EQL threat detection example","user":{"login":"ywangd","id":2344308,"node_id":"MDQ6VXNlcjIzNDQzMDg=","avatar_url":"https://avatars3.githubusercontent.com/u/2344308?v=4","gravatar_id":"","url":"https://api.github.com/users/ywangd","html_url":"https://github.com/ywangd","followers_url":"https://api.github.com/users/ywangd/followers","following_url":"https://api.github.com/users/ywangd/following{/other_user}","gists_url":"https://api.github.com/users/ywangd/gists{/gist_id}","starred_url":"https://api.github.com/users/ywangd/starred{/owner}{/repo}","subscriptions_url":"https://api.github.com/users/ywangd/subscriptions","organizations_url":"https://api.github.com/users/ywangd/orgs","repos_url":"https://api.github.com/users/ywangd/repos","events_url":"https://api.github.com/users/ywangd/events{/privacy}","received_events_url":"https://api.github.com/users/ywangd/received_events","type":"User","site_admin":false},"labels":[{"id":1690690117,"node_id":"MDU6TGFiZWwxNjkwNjkwMTE3","url":"https://api.github.com/repos/elastic/elasticsearch/labels/:Query%20Languages/EQL","name":":Query Languages/EQL","color":"0e8a16","default":false,"description":"EQL querying"},{"id":23715,"node_id":"MDU6TGFiZWwyMzcxNQ==","url":"https://api.github.com/repos/elastic/elasticsearch/labels/%3Edocs","name":">docs","color":"db755e","default":false,"description":"General docs changes"},{"id":1967497573,"node_id":"MDU6TGFiZWwxOTY3NDk3NTcz","url":"https://api.github.com/repos/elastic/elasticsearch/labels/Team:Docs","name":"Team:Docs","color":"fef2c0","default":false,"description":"Meta label for docs team"},{"id":1967501040,"node_id":"MDU6TGFiZWwxOTY3NTAxMDQw","url":"https://api.github.com/repos/elastic/elasticsearch/labels/Team:QL","name":"Team:QL","color":"fef2c0","default":false,"description":"Meta label for query languages team"}],"state":"closed","locked":false,"assignee":{"login":"jrodewig","id":40268737,"node_id":"MDQ6VXNlcjQwMjY4NzM3","avatar_url":"https://avatars1.githubusercontent.com/u/40268737?v=4","gravatar_id":"","url":"https://api.github.com/users/jrodewig","html_url":"https://github.com/jrodewig","followers_url":"https://api.github.com/users/jrodewig/followers","following_url":"https://api.github.com/users/jrodewig/following{/other_user}","gists_url":"https://api.github.com/users/jrodewig/gists{/gist_id}","starred_url":"https://api.github.com/users/jrodewig/starred{/owner}{/repo}","subscriptions_url":"https://api.github.com/users/jrodewig/subscriptions","organizations_url":"https://api.github.com/users/jrodewig/orgs","repos_url":"https://api.github.com/users/jrodewig/repos","events_url":"https://api.github.com/users/jrodewig/events{/privacy}","received_events_url":"https://api.github.com/users/jrodewig/received_events","type":"User","site_admin":false},"assignees":[{"login":"jrodewig","id":40268737,"node_id":"MDQ6VXNlcjQwMjY4NzM3","avatar_url":"https://avatars1.githubusercontent.com/u/40268737?v=4","gravatar_id":"","url":"https://api.github.com/users/jrodewig","html_url":"https://github.com/jrodewig","followers_url":"https://api.github.com/users/jrodewig/followers","following_url":"https://api.github.com/users/jrodewig/following{/other_user}","gists_url":"https://api.github.com/users/jrodewig/gists{/gist_id}","starred_url":"https://api.github.com/users/jrodewig/starred{/owner}{/repo}","subscriptions_url":"https://api.github.com/users/jrodewig/subscriptions","organizations_url":"https://api.github.com/users/jrodewig/orgs","repos_url":"https://api.github.com/users/jrodewig/repos","events_url":"https://api.github.com/users/jrodewig/events{/privacy}","received_events_url":"https://api.github.com/users/jrodewig/received_events","type":"User","site_admin":false}],"milestone":null,"comments":2,"created_at":"2020-08-20T01:28:58Z","updated_at":"2020-08-20T13:55:50Z","closed_at":"2020-08-20T13:55:50Z","author_association":"MEMBER","active_lock_reason":null,"body":"The [doc](https://www.elastic.co/guide/en/elasticsearch/reference/master/eql-ex-threat-detection.html#eql-ex-check-for-command-line-artifacts) page has the following query example:\r\n\r\n```\r\nGET /my-index-000001/_eql/search\r\n{\r\n  \"query\": \"\"\"\r\n    process where process.name == \"regsvr32.exe\" and process.command_line != null\r\n  \"\"\"\r\n}\r\n```\r\nHowever the `process.command_line` field must be of `keyword` type for the above query to work. Otherwise, you'll get back an `illegal_argument_exception`. The doc test has this configuration in its [build.gradle](https://github.com/elastic/elasticsearch/blob/5457b34343838f11081c8c34234d79fcb6d1cecd/docs/build.gradle#L1462-L1463) file so it works on CI. But the doc itself does not mention this. If an user just follow the documentation by straightaway bulk indexing the provided JSON file, he/she will encounter error at the above query.","closed_by":{"login":"jrodewig","id":40268737,"node_id":"MDQ6VXNlcjQwMjY4NzM3","avatar_url":"https://avatars1.githubusercontent.com/u/40268737?v=4","gravatar_id":"","url":"https://api.github.com/users/jrodewig","html_url":"https://github.com/jrodewig","followers_url":"https://api.github.com/users/jrodewig/followers","following_url":"https://api.github.com/users/jrodewig/following{/other_user}","gists_url":"https://api.github.com/users/jrodewig/gists{/gist_id}","starred_url":"https://api.github.com/users/jrodewig/starred{/owner}{/repo}","subscriptions_url":"https://api.github.com/users/jrodewig/subscriptions","organizations_url":"https://api.github.com/users/jrodewig/orgs","repos_url":"https://api.github.com/users/jrodewig/repos","events_url":"https://api.github.com/users/jrodewig/events{/privacy}","received_events_url":"https://api.github.com/users/jrodewig/received_events","type":"User","site_admin":false},"performed_via_github_app":null}